{"id": "vilnius_city_overview", "text": "Vilnius is compact and walkable. Nightlife is centered around the Old Town and the area around Gedimino prospektas, with many bars and small venues close together.", "metadata": {"city": "Vilnius", "country": "LT", "type": "city_guide", "tags": ["overview", "nightlife"]}}
{"id": "vilnius_romantic_evening", "text": "For a romantic evening in Vilnius, a common pattern is dinner in the Old Town, a walk through Užupis or along the river, then a small bar with live music or wine.", "metadata": {"city": "Vilnius", "country": "LT", "type": "date_ideas", "tags": ["romantic", "evening"]}}
{"id": "vilnius_live_music", "text": "Live music in Vilnius is often in smaller bars and clubs rather than huge arenas. Weekends are busiest; Thursday nights are also popular for concerts and DJ events.", "metadata": {"city": "Vilnius", "country": "LT", "type": "music", "tags": ["live_music", "weekend"]}}
{"id": "vilnius_budget_tips", "text": "Budget nights out in Vilnius usually involve free or cheap events in bars, happy-hour drink deals, and walking between venues instead of using taxis.", "metadata": {"city": "Vilnius", "country": "LT", "type": "budget", "tags": ["budget", "student_friendly"]}}
{"id": "kaunas_overview", "text": "Kaunas has a concentrated nightlife around Laisvės alėja and the Old Town. Many venues are casual and within walking distance, good for bar-hopping.", "metadata": {"city": "Kaunas", "country": "LT", "type": "city_guide", "tags": ["overview", "nightlife"]}}
{"id": "tallinn_overview", "text": "Tallinn’s Old Town is the main area for bars and clubs. The Telliskivi district has a creative vibe with galleries, food halls, and events.", "metadata": {"city": "Tallinn", "country": "EE", "type": "city_guide", "tags": ["overview", "arts"]}}
{"id": "riga_overview", "text": "Riga has a mix of cocktail bars, pubs, and clubs around the Old Town and the centre. Many venues host DJs or live music on weekends.", "metadata": {"city": "Riga", "country": "LV", "type": "city_guide", "tags": ["overview", "nightlife"]}}
{"id": "berlin_nightlife", "text": "Berlin nightlife is spread across multiple districts. Long queues and late start times are normal for clubs, and many places have door policies based on vibe rather than dress code.", "metadata": {"city": "Berlin", "country": "DE", "type": "city_guide", "tags": ["nightlife", "clubs"]}}
{"id": "family_friendly_evening", "text": "Family-friendly evenings often combine a casual early dinner, an outdoor activity like a park or river walk, and an event with clear end time such as a movie or early concert.", "metadata": {"city": null, "country": null, "type": "pattern", "tags": ["family", "kids"]}}
{"id": "safety_general", "text": "Good general safety advice for nights out: stay in well-lit areas, keep your phone charged, agree on a meeting point with friends, and use trusted transport options late at night.", "metadata": {"city": null, "country": null, "type": "safety", "tags": ["safety", "general"]}}
{"id": "cheap_or_free_events", "text": "Cheap or free events are often open-mic nights, student parties, bar gigs without a ticket, museum late openings, and seasonal city festivals.", "metadata": {"city": null, "country": null, "type": "budget", "tags": ["budget", "free"]}}
{"id": "digest_explanation", "text": "A weekly digest is a summary of upcoming events that match your city and interests, sent as a short list you can quickly skim instead of searching manually.", "metadata": {"city": null, "country": null, "type": "product", "tags": ["digest", "product_help"]}}
{"id": "socialite_agent_explanation", "text": "The Socialite AI agent uses your saved city and passions plus live event data to build short, actionable plans instead of long lists of links.", "metadata": {"city": null, "country": null, "type": "product", "tags": ["agent", "product_help"]}}
